# SetRenderingAsset Method (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
AppearanceAssetElement..::..SetRenderingAsset Method
AppearanceAssetElement Class See Also
---
Sets the rendering asset for the appearance asset element.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2014
# Syntax
C#
---
```text
public void SetRenderingAsset(
	Asset asset
)
```

Visual Basic
---
```text
Public Sub SetRenderingAsset ( _
	asset As Asset _
)
```

Visual C++
---
```text
public:
void SetRenderingAsset(
	Asset^ asset
)
```

# ### Parameters
asset
    Type: Autodesk.Revit.DB.Visual..::..Asset The new rendering asset. It should be an appearance asset.
# Exceptions
| Exception | Condition |
| --- | --- |
| --- | --- |
| Autodesk.Revit.Exceptions..::..ArgumentNullException | A non-optional argument was null |
| Autodesk.Revit.Exceptions..::..ArgumentOutOfRangeException | The asset is not an appearance asset. |

# See Also
AppearanceAssetElement Class
Autodesk.Revit.DB Namespace